app/controllers/kinds_controller.rb

  def find_kind
    @kind = Kind.find(params[:id])
---
SELECT * FROM "kinds" WHERE ("kinds"."id" = 524194734)

  def index
    @kinds = Kind.all
---
SELECT * FROM "kinds"

  def create
    @kind = Kind.new(params[:kind])

    respond_to do |format|
      if @kind.save
---
INSERT INTO "kinds" ("updated_at", "portugues", "picture_content_type", "description", "picture_file_name", "picture_updated_at", "picture_file_size", "scientific", "created_at") VALUES('2009-07-21 17:12:33', 'Pau Brasil', 'image/jpeg', 'Poucos brasileiros já tiveram o privilégio de ver uma árvore de pau-brasil. Isso porque as regiões onde eram encontradas grandes quantidades desta espécie sofreram um violento processo de devastação que praticamente fez com que o pau-brasil fosse incluído na lista das espécies ameaçadas de extinção.', 'pau_brasil.jpg', '2009-07-21 17:12:32', 18129, 'Caesalpinia echinata Lam', '2009-07-21 17:12:33')

  def update
    respond_to do |format|
      if @kind.update_attributes(params[:kind])
---
UPDATE "kinds" SET "picture_file_size" = 61429, "picture_file_name" = 'IMG_2563.jpg', "picture_updated_at" = '2009-07-21 16:39:11', "picture_content_type" = 'image/jpeg', "updated_at" = '2009-07-21 16:39:13' WHERE "id" = 524194731

  def destroy
    if !@kind.trunks.empty?
      flash[:error] = "There are still " + @kind.trunks.size.to_s + " trunks referencing this species. Remove all referencing trunks first!"
      redirect_to kinds_path
      return
    end
    @kind.destroy
---
SELECT count(*) AS count_all FROM "trunks" WHERE ("trunks".kind_id = 524194750)
DELETE FROM "kinds" WHERE "id" = 524194732