app/controllers/process_trunks_controller.rb

  def find_process_trunk
    @process_trunk = ProcessTrunk.find(params[:id])
---
SELECT * FROM "process_trunks" WHERE ("process_trunks"."id" = 715629980)
SELECT * FROM "trunks" WHERE ("trunks"."id" = 953125641)

  def index
    @process_trunks = ProcessTrunk.all
---
SELECT * FROM "process_trunks"

  def create
    @process_trunk = ProcessTrunk.new(params[:process_trunk])

    respond_to do |format|
      if @process_trunk.save
---
INSERT INTO "process_trunks" ("updated_at", "date", "trunk_id", "description", "created_at") VALUES('2009-07-18 01:21:16', '2009-07-18 00:00:00', 442820205, '3.', '2009-07-18 01:21:16')

  def update

    respond_to do |format|
      if @process_trunk.update_attributes(params[:process_trunk])
---
UPDATE "process_trunks" SET "date" = '2009-07-13 00:00:00', "description" = 'This is the second process step in the history of the first trunk.', "updated_at" = '2009-07-23 17:58:15' WHERE "id" = 708091994

  def destroy
    @process_trunk.destroy
---
DELETE FROM "process_trunks" WHERE "id" = 715629980