app/controllers/trunks_controller.rb

SELECT * FROM "trunks" WHERE ("trunks"."id" = 442820205)
---
  def find_trunk
    @trunk = Trunk.find(params[:id])

INSERT INTO "trunks" ("updated_at", "traceable", "loc_lat", "loc_lon", "description", "volume", "species_id", "created_at") VALUES('2009-07-18 22:23:32', '12345678', '-23.5703732', '-46.6933187', NULL, NULL, 476852399, '2009-07-18 22:23:32')
---
  def create
    @trunk = Trunk.new(params[:trunk])
    if @trunk.save

DELETE FROM "trunks" WHERE "id" = 1
---
  def destroy
    @trunk.destroy

UPDATE "trunks" SET "description" = 'This is the Fraxinus excelsion with the traceable 98765432 and the volume of 5.9', "updated_at" = '2009-07-18 14:54:22' WHERE "id" = 442820205
---
  def update
    if @trunk.update_attributes(params[:trunk])

SELECT * FROM "trunks" WHERE ("trunks"."traceable" = '98765432') LIMIT 1
---
  def show_google_map
    code = params[:input_traceable_code]
    unless (code =~ /\d{8}/)
      flash[:error] = "TraceableTree code is composed of 8 numerals"
      redirect_to lookup_trunk_path
      return
    end
    #begin
      @trunk = Trunk.find_by_traceable(code)